{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"batch_normalization_input": {"name": "batch_normalization_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "3"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["batch_normalization_input", "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "VkFMSUQ="}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/output/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/output/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [576, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "shape": [64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset", "shape": [3], "dtype": "float32"}]}]}